
#include <inavr.h>

#include "src/driver/atmega8/Common.h"
#include "src/driver/atmega8/gpio/Gpio.h"
#include "src/service/DvrControl.h"





/*
Алгоритм управления камерой
0. Сработал PIR сенсор
1. Вкл. и удерживаем Power (>1 сек)
2. Загорается синий светодиод
3. Отпускаем Power
4. Один раз мигнет красный диод, камера включена
5. Нажимаем  Rec
6. Начинает мигать красный диод
7. Выжидаем окончание времени записи, при срабатывании PIR сенсора, обновляем время,
   по истечении времени останавливаем запись нажатием Rec (не обязательно)
8. Красный диод начинает быстро мигать (идет сохранение)
9. Нажимаем Power
10. Синий диод гаснет. Уходим в спящий рeжим

Step              01    2 3   4     5   6                7    8      9   10
Pir sensor      __/"""""""""""""""\__________/""""\_____________________________
Blue Led        ________/""""""""""""""""""""""""""""""""""""""""""""""""\______
Red Led         ______________/""\______/""\__/""\__/""\______/\/\/\____________
Power button    ___/""""""\__________________________________________/"\________
Rec buttton     ____________________/""\_________________/""\___________________
*/




void main(void) {
    Gpio gpio = Gpio();
    CommonDriver commonDriver = CommonDriver();
    commonDriver.init();
    DvrControl dvrControl = DvrControl(gpio, commonDriver);

    while (1) {
        dvrControl.begin();
        commonDriver.systemSleep();
    }
}
